var product =[
	{
   	img:'img2/37-yagodi.png',
   	description: 'Заморозка позволяет сохранить вкусный летний урожай с полным набором витаминов, содержащихся в ягодах. Поэтому на вопрос: «можно ли заморозить ягоды», мы...',
   	title:'СОЧНЫЕ ЯГОДЫ В ЗИМНЮЮ ПОРУ',
    textpoduct: 'Заморозка позволяет сохранить вкусный летний урожай с полным набором витаминов, содержащихся в ягодах. Поэтому на вопрос: «можно ли заморозить ягоды», мы отвечаем утвердительно, ни секунды не задумываясь. Только представьте, как зимой будете лакомиться вкуснейшими пирогами со свежей черникой, ароматным вишневым компотом или ягодным ассорти. Замороженные ягоды детям покажутся настоящим летним чудом средь зимы.'
 	},
 	{
   	img:'img2/2010-kartoshka.jpg',
   	description: 'С помощью заморозки возможно заготовить практически все овощи и фрукты, а также готовое мясо, тесто, чипсы и даже яйца. Поэтому нет ничего удивительного,...',
   	title:'ЗАМОРОЗКА КАРТОФЕЛЯ В ДОМАШНИХ УСЛОВИЯХ',
    textpoduct:'Подобные хитрости помогают заметно сэкономить время на ежедневной готовке, при этом сохранив пищевую ценность овоща.СПОСОБЫ ЗАМОРОЗКИ КАРТОФЕЛЯИзначально необходимо отобрать довольно крупные клубни без изъянов, помыть их и очистить от шкурки. Поскольку картофель возможно морозить несколькими способами, то и дальнейшие подготовительные действия будут также разниться:'
 	},
 	{
   	img:'img2/1997-photo17.jpg',
   	description: 'Заморозка перца на зиму – мероприятие во всех отношениях полезное. Так вы обеспечите родных и близких вкусными блюдами с участием этого овоща, сохраните...',
   	title:'ОСОБЕННОСТИ ЗАМОРОЗКИ ПЕРЦА',
    textpoduct: 'Заморозка перца на зиму – мероприятие во всех отношениях полезное. Так вы обеспечите родных и близких вкусными блюдами с участием этого овоща, сохраните максимальное количество витаминов и микроэлементов, содержащихся в нем, а также существенно сэкономите. Больше не придется покупать не в сезон импортные овощи по баснословным ценам.'
 	},
 	{
   	img:'img2/1998-photo7.jpg',
   	description: 'Заморозка фруктов на зиму – простая и экономичная альтернатива различным видам консервации. С помощью замораживания можно быстро и без дополнительных затрат...',
   	title:'КАК ПРАВИЛЬНО ЗАМОРАЖИВАТЬ ФРУКТЫ',
    textpoduct:'Заморозка фруктов на зиму – простая и экономичная альтернатива различным видам консервации. С помощью замораживания можно быстро и без дополнительных затрат сделать заготовки летнего урожая. При условии правильной подготовки и хранения, замороженные плоды сохранятся до 8-12 месяцев. При этом потери витаминов, находящихся в их составе, будут минимальными – до 20%. Для сравнения: при варке витаминный комплект фруктов уменьшается вдвое.'
 	},
 	{
   	img:'img2/1999-photo3.jpg',
   	description: 'Заморозка овощей на зиму в домашних условиях – разве можно заготовить припасы еще проще? Посудите сами:<br>экономия времени;<br>не нужно часами...',
   	title:'ВСЕ ПОЛЕЗНЫЕ СВОЙСТВА ОВОЩЕЙ ПРИ ЗАМОРОЗКЕ',
    textpoduct:'Заморозка овощей на зиму в домашних условиях – разве можно заготовить припасы еще проще? Посудите сами:экономия времени;не нужно часами стоять у плиты, чтобы уварить овощные заготовки;максимальная сохранность витамин и микроэлементов;круглогодичное наличие свежих овощей на вашем столе.Преимущества такого вида заготовок как овощная заморозка бесспорны, поэтому многие хозяйки все чаще отдают предпочтение именно этому методу.'
 	},
 	{
   	img:'img2/1980-photo2.jpg',
   	description: 'Замораживают ли грибы? Без сомнения! Причем в вашу морозильную камеру могут попасть на длительное хранение любые съедобные грибы: от опят...',
   	title:'ЗАГОТОВКА НА ЗИМУ: ГРИБЫ',
    textpoduct:'Замораживают ли грибы? Без сомнения! Причем в вашу морозильную камеру могут попасть на длительное хранение любые съедобные грибы: от опят до боровиков. Для сохранения аромата, внешнего вида и характерного грибного вкуса следует придерживаться основных правил замораживания:выбирайте свежесобранные, молодые и цельные грибные экземпляры; если речь идет о заготовке сыроежек, подосиновиков, опят, волнушек, рыжиков и боровиков, их заморозка вполне допустима в течение суток; грибы с особой губчатой тканью под шляпкой морозят лишь свежими, поскольку после термической обработки и длительной криотерапии они утратят и вкус, и форму; после размораживания грибы должны быть использованы сразу же. Формируйте заготовки оптимальными разовыми порциями, поскольку вторичное замораживание является абсолютно недопустимым; метод сухой заморозки исключает мытье грибных припасов.'
 	},
 	{
   	img:'img2/1982-photo11.jpg',
   	description: 'Замораживание зелени помогает сохранить полезные микроэлементы и витамины, содержащиеся в ней, в течение долгого времени.',
   	title:'ЗИМНЯЯ ЗЕЛЕНЬ - ПРАВИЛА ЗАМОРОЗКИ',
    textpoduct:'Замораживание зелени помогает сохранить полезные микроэлементы и витамины, содержащиеся в ней, в течение долгого времени.КАКУЮ ЗАМОРАЖИВАТЬ ЗЕЛЕНЬПри выборе зелени для зимних заготовок можете всецело руководствоваться собственными гастрономическими предпочтениями, однако учесть некоторые особенности не помешает:'
 	},
 	{
   	img:'img2/1983-photo14.jpg',
   	description: 'Возможно ли замораживать рыбу? На этот вопрос мы без раздумий отвечаем утвердительно, ведь заморозка свежей рыбы помогает сохранить ее пищевую ценность на...',
   	title:'КАК ПРАВИЛЬНО ЗАМОРОЗИТЬ РЫБУ',
    textpoduct:'Возможно ли замораживать рыбу? На этот вопрос мы без раздумий отвечаем утвердительно, ведь заморозка свежей рыбы помогает сохранить ее пищевую ценность на протяжении длительного периода. В результате вы сможете наслаждаться вкусной и полезной рыбой тогда, когда пожелаете.'
 	},
 	{
   	img:'img2/1984-photo12.jpg',
   	description: 'Скоростной ритм современной жизни предъявляет к нам высокие требования. Работая с утра до вечера, мы мечтаем очутиться дома и собраться за вкусным семейным...',
   	title:'ИНСТРУКЦИЯ ПО ЗАМОРОЗКЕ ПОЛУФАБРИКАТОВ',
    textpoduct:'Скоростной ритм современной жизни предъявляет к нам высокие требования. Работая с утра до вечера, мы мечтаем очутиться дома и собраться за вкусным семейным ужином. Но ведь и на его приготовление требуется немало времени. Как быть: после работы долго простаивать у плиты или отдать предпочтение магазинным полуфабрикатам? У нас есть вариант получше - заморозка домашних полуфабрикатов. Так вы всегда сможете накормить семью, а также внезапных гостей, вкусными и полезными блюдами.РЕЦЕПТ ЗАМОРОЗОК ПОЛУФАБРИКАТОВВариантов полуфабрикатов для замораживания великое множество. Выбор замороженного меню всецело зависит от гастрономических предпочтений ваших домочадцев. Это могут быть:'
 	},
 	{
   	img:'img2/2000-photo15.jpg',
   	description: 'Неожиданные продукты для домашней заморозки<br>Домашние заморозки – отличный способ сохранить продукты на длительный срок без ущерба для их пищевой...',
   	title:'ПОЛНЫЙ ГИД ПО ЗАМОРОЗКЕ ПРОДУКТОВ',
    textpoduct:'Полный гид по заморозке продуктов. НЕОЖИДАННЫЕ ПРОДУКТЫ ДЛЯ ДОМАШНЕЙ ЗАМОРОЗКИДомашние заморозки – отличный способ сохранить продукты на длительный срок без ущерба для их пищевой ценности.. Более опытные хозяюшки с помощью заморозки делают заготовки на зиму. Сегодня заморозка на зиму является удобной и экономичной альтернативой всевозможным консервациям, поэтому заготовка пищевых припасов способом замораживания становится все более популярной. При этом далеко не всем известны преимущества данной методики до конца. Что же могло ускользнуть от нашего внимания? Давайте разбираться.'
 	},
 	{
   	img:'img2/1979-photo1.jpg',
   	description: 'Наличие морозильной камеры, знание нехитрых рецептов и правил заморозки, плюс немного свободного времени - вместе способны превратить любую хозяйку в...',
   	title:'МАКСИМУМ ВКУСА В ЗАМОРОЖЕННЫХ КАБАЧКАХ',
    textpoduct:'Наличие морозильной камеры, знание нехитрых рецептов и правил заморозки, плюс немного свободного времени - вместе способны превратить любую хозяйку в настоящую королеву зимних заготовок. КАК ЗАМОРОЗИТЬ КАБАЧКИ? важен внимательный отбор овощей, предназначенных для зимовки. Отлично подойдут так называемые «молочные» кабачки: с тонкой шкуркой, мелкими и еще не до конца сформировавшимися семечками; если одна из сторон выбранного цуккини или кабачка потемнела, сморщилась или треснула, тогда эта часть нещадно срезается;'
  },
 	{
   	img:'img2/1985-photo5.jpg',
   	description: 'Когда представляется возможность выгодно купить мясо оптом или необходимо заготовить его впрок, хозяек зачастую терзают сомнения: «можно ли замораживать...',
   	title:'ВСЕ ЧТО НУЖНО ЗНАТЬ О ЗАМОРОЗКЕ МЯСА',
    textpoduct:'Когда представляется возможность выгодно купить мясо оптом или необходимо заготовить его впрок, хозяек зачастую терзают сомнения: «можно ли замораживать мясо, не потеряет ли оно полезные свойства и вкусовые качества после пребывания в морозилке?»'
 	},
  {
    img:'img2/1988-photo6.jpg',
    description: 'Капуста – вкусный и полезный продукт, любимый многими. Многообразие видов, внушительный набор полезных свойств и обширный спектр капустных блюд – вот почему...',
    title:'ЦВЕТНАЯ, БЕЛОКАЧАННАЯ КАПУСТА – КАК ЗАМОРАЖИВАТЬ?',
    textpoduct: 'Капуста – вкусный и полезный продукт, любимый многими. Многообразие видов, внушительный набор полезных свойств и обширный спектр капустных блюд – вот почему многие хозяйки отдают предпочтение этому овощу и активно используют его для домашних заготовок.'
  },
  {
    img:'img2/1989-photo16.jpg',
    description: 'Морозильные камеры давно перестал быть роскошью и излишеством. Сегодня это приспособление избавило хозяюшек от необходимости делать многочисленные...',
    title:'ЧТО НЕОБХОДИМО УЧИТЫВАТЬ ПРИ ВЫБОРЕ МОРОЗИЛЬНОЙ КАМЕРЫ?',
    textpoduct: 'Морозильные камеры давно перестал быть роскошью и излишеством. Сегодня это приспособление избавило хозяюшек от необходимости делать многочисленные консервации на зиму. Способ заморозки не только удобный и менее затратный, но и позволяет максимально сохранить витамины в заготавливаемых продуктах. Это преимущество является, пожалуй, решающим аргументом в пользу морозилки. Остается лишь определиться с оптимальной разновидностью морозильного устройства. Мы подготовили несколько рекомендаций, которые помогут понять, как правильно выбрать морозильную камеру.'
  },
  {
    img:'img2/1990-photo13.jpg',
    description: 'Когда речь идет о заморозке на зиму ягод и фруктов, на ум сразу приходят самые популярные участники заготовительных мероприятий: вишня, смородина, слива и...',
    title:'ЛЕТНИЙ ВКУС ШЕЛКОВИЦЫ ЗИМОЙ',
    textpoduct: 'Когда речь идет о заморозке на зиму ягод и фруктов, на ум сразу приходят самые популярные участники заготовительных мероприятий: вишня, смородина, слива и прочие. Шелковица же в этом ряду встречается редко, и напрасно. Многие хозяйки даже не подозревают, чем полезна шелковица, и насколько велика ее витаминная ценность.'
  },
  {
    img:'img2/1991-photo8.jpg',
    description: 'Заморозка слив на зиму имеет массу преимуществ. Благодаря этой заготовительной методике потери полезных свойств плодов оказываются минимальными. Для...',
    title:'ЗАГОТОВКА СЛИВ НА ЗИМУ',
    textpoduct: 'Заморозка слив на зиму имеет массу преимуществ. Благодаря этой заготовительной методике потери полезных свойств плодов оказываются минимальными. Для сравнения: при замораживании теряется всего лишь 20% витаминных запасов сливы, а при варке – до 40-50%.Слива богата микроэлементами, органическими кислотами, различными пищевыми волокнами и витаминами (А, В, С и Е).КАК ЗАМОРОЗИТЬ СЛИВЫ?Приведем несколько дельных советов, как сохранить летний урожай в течение долгого времени:для заморозки подходят плотные, мясистые и в меру спелые сливы. Кроме того плоды следует выбирать без следов гниения и механических повреждений; подготовительный этап подразумевает очистку фруктов от хвостиков, мытье и тщательное просушивание;'
  },
  {
    img:'img2/1993-photo18.jpg',
    description: 'Заготовка крыжовника на зиму с помощью заморозки позволит просто и быстро сохранить ягоду с максимальным количеством полезных веществ до момента...',
    title:'КРЫЖОВНИК ВНЕ СЕЗОНА – ПРАВИЛА ЗАМОРОЗКИ',
    textpoduct: 'Заготовка крыжовника на зиму с помощью заморозки позволит просто и быстро сохранить ягоду с максимальным количеством полезных веществ до момента употребления. Крыжовник богат витамином Р и пектинами, а по содержанию витамина С он превосходит даже малину и землянику. Возможно, вы будете удивлены, но и железа в нем больше, чем в яблоках и сливе. Именно поэтому многие хозяюшки отдают предпочтение этой ягоде, делая из нее любимые зимние заготовки.'
  },
  {
    img:'img2/1994-photo9.jpg',
    description: 'Вишня на зиму станет отличной поддержкой иммунитета в период холодов, гриппа и прочих респираторных инфекций. Она богата содержанием витаминов (C, PP, В6 и...',
    title:'ПРАВИЛА ЗАМОРОЗКИ ВИШНИ',
    textpoduct: 'Прежде чем приступить к заполнению морозильной камеры вишней, следует решить: для каких целей предназначается замораживаемый урожай, в каких объемах он необходим. Так будет проще выбрать метод подготовки и заморозки вишен, а также освободить место в морозилке для удобного хранения заготовок.Приведем несколько практических советов, как правильно заморозить вишню:если морозить вишню с косточкой, она сохранит значительно большее количество сока; выбирайте целые и зрелые ягоды, но не переспевшие;'
  },
  {
    img:'img2/1995-photo10.jpg',
    description: 'Абрикос - полезный и вкусный фрукт, которого так не достает зимой, когда за окном стужа и метель, а организм испытывает острый дефицит витаминов. Фрукты в...',
    title:'ЗАМОРОЗКА АБРИКОС В ДОМАШНИХ УСЛОВИЯХ',
    textpoduct: 'Абрикос - полезный и вкусный фрукт, которого так не достает зимой, когда за окном стужа и метель, а организм испытывает острый дефицит витаминов. Фрукты в супермаркетах лишь внешним видом напоминают плоды, выращенные на даче, и мы все чаще вспоминаем о летнем урожае.'
  },
  {
    img:'img2/1935-klubnika.png',
    description: 'Для того, чтобы лакомится вкусной клубникой круглый год, стоит заблаговременно подготовить запасы. Есть несколько проверенных способов как это сделать. Мы...',
    title:'КАК ЗАМОРОЗИТЬ КЛУБНИКУ НА ЗИМУ',
    textpoduct: 'Для того, чтобы лакомится вкусной клубникой круглый год, стоит заблаговременно подготовить запасы. Есть несколько проверенных способов как это сделать. Мы подобрали 4, самых удобных и надежных варианта заморозки, которые в зависимости от сорта и ваших вкусовых предпочтений приятно порадуют вас вне ягодного сезона.'
  }
];
var wrap = document.querySelector('.encyclist');
loaded();
$('.encyclopedia_menu_item:nth-child(1)').on('click', function(event){
  $('.encyclopedia_menu_item:nth-child(1) a').css('color','#000c31')
  $('.encyc_item').remove()
  loaded()
  event.preventDefault()
});
function loaded(){
  for(i = 0; i<12; i++){
    creatureItem()
  };
  var buttonMore = document.createElement('div');
  buttonMore.className = 'button btnmore';
  wrap.appendChild(buttonMore);
  var buttonTitle = document.createElement('p');
  buttonTitle.innerHTML = 'ПОКАЗАТЬ ЕЩЕ';
  buttonMore.appendChild(buttonTitle);

  buttonMore.onclick= function(){
    buttonMore.style.display = 'none';
    for(i = 12; i<product.length; i++){
      creatureItem();
    }
  }
};

var res;
var rst;
$('.encyclopedia_menu_item:nth-child(2)').on('click', function(event){
  $('.encyclopedia_menu_item a').css('color','#586386');
  $('.encyclopedia_menu_item:nth-child(2) a').css('color','#000c31');
  $('.encyc_item').remove();
  $('.btnmore').remove();
    for(i = 0; i<product.length; i++){
      res = product[i].textpoduct.search(/овощ/);
      if(res>0){
        rst = $('div:contains(res)');
        creatureItem();
      }
    }
  event.preventDefault();
});
$('.encyclopedia_menu_item:nth-child(3)').on('click', function(event){
  $('.encyclopedia_menu_item a').css('color','#586386')
  $('.encyclopedia_menu_item:nth-child(3) a').css('color','#000c31')
  $('.encyc_item').remove();
  $('.btnmore').remove();
  event.preventDefault();
  for(i = 0; i<product.length; i++){
    res = product[i].textpoduct.search(/гриб/);
    if(res>0){

      rst = $('div:contains(res)');
      console.log(rst)
      creatureItem();
    }
  }
  event.preventDefault();
});
$('.encyclopedia_menu_item:nth-child(4)').on('click', function(event){
   $('.encyclopedia_menu_item a').css('color','#586386')
  $('.encyclopedia_menu_item:nth-child(4) a').css('color','#000c31')
   $('.encyc_item').remove();
   $('.btnmore').remove();
   event.preventDefault()
      for(i = 0; i<product.length; i++){
        res = product[i].textpoduct.search(/зелен/);
        if(res>0){
          rst = $('div:contains(res)')
          creatureItem()
       }
    }
      event.preventDefault()
});
$('.encyclopedia_menu_item:nth-child(5)').on('click', function(event){
   $('.encyclopedia_menu_item a').css('color','#586386')
  $('.encyclopedia_menu_item:nth-child(5) a').css('color','#000c31')
   $('.encyc_item').remove();
   $('.btnmore').remove();
      for(i = 0; i<product.length; i++){
        res = product[i].textpoduct.search(/фрукт/);

        if(res>0){
          rst = $('div:contains(res)')
          creatureItem()
       }
      }
       event.preventDefault()
});
$('.encyclopedia_menu_item:nth-child(6)').on('click', function(event){
   $('.encyclopedia_menu_item a').css('color','#586386')
  $('.encyclopedia_menu_item:nth-child(6) a').css('color','#000c31')
   $('.encyc_item').remove();
   $('.btnmore').remove();
      for(i = 0; i<product.length; i++){
        res = product[i].textpoduct.search(/ягод/);
        if(res>0){
          rst = $('div:contains(res)')
          creatureItem()
       }
      }
      event.preventDefault()
});
$('.encyclopedia_menu_item:nth-child(7)').on('click', function(event){
   $('.encyclopedia_menu_item a').css('color','#586386')
  $('.encyclopedia_menu_item:nth-child(7) a').css('color','#000c31')
   $('.encyc_item').remove();
   $('.btnmore').remove();
      for(i = 0; i<product.length; i++){
        res = product[i].textpoduct.search(/мясо/);
        if(res>0){
          rst = $('div:contains(res)')
          creatureItem()
       }
      }
      event.preventDefault()
});
$('.encyclopedia_menu_item:nth-child(8)').on('click', function(event){
   $('.encyclopedia_menu_item a').css('color','#586386')
  $('.encyclopedia_menu_item:nth-child(8) a').css('color','#000c31')
   $('.encyc_item').remove();
   $('.btnmore').remove();
      for(i = 0; i<product.length; i++){
        res = product[i].textpoduct.search(/рыб/);
        if(res>0){
          rst = $('div:contains(res)')
          creatureItem()
       }
      }
      event.preventDefault()
});
$('.encyclopedia_menu_item:nth-child(9)').on('click', function(event){
   $('.encyclopedia_menu_item a').css('color','#586386')
  $('.encyclopedia_menu_item:nth-child(9) a').css('color','#000c31')
   $('.encyc_item').remove();
   $('.btnmore').remove();
      for(i = 0; i<product.length; i++){
        res = product[i].textpoduct.search(/полуфабрикат/);
        if(res>0){
          rst = $('div:contains(res)')
          creatureItem()
       }
      }
      event.preventDefault()
});
$('.encyclopedia_menu_item:nth-child(10)').on('click', function(event){
   $('.encyclopedia_menu_item a').css('color','#586386')
  $('.encyclopedia_menu_item:nth-child(10) a').css('color','#000c31')
   $('.encyc_item').remove();
   $('.btnmore').remove();
      for(i = 0; i<product.length; i++){
        res = product[i].textpoduct.search(/разновидн/);
        if(res>0){
          rst = $('div:contains(res)')
          creatureItem()
       }
      }
      event.preventDefault()
});
$('.encyclopedia_menu_item:nth-child(11)').on('click', function(event){
   $('.encyclopedia_menu_item a').css('color','#586386')
  $('.encyclopedia_menu_item:nth-child(11) a').css('color','#000c31')
   $('.encyc_item').remove();
   $('.btnmore').remove();
      for(i = 0; i<product.length; i++){
        res = product[i].textpoduct.search(/гид/);
        if(res>0){
          rst = $('div:contains(res)')
          creatureItem()
       }
      }
      event.preventDefault()
});
 function creatureItem(){
      var container = document.createElement('div');
         container.className = 'encyc_item';
         wrap.appendChild(container);
         var box = document.createElement('div');
         box.className = 'encyc_itembox';
         container.appendChild(box)
         var image = document.createElement('img');
         image.className = 'encyc_itemimg';
         image.src = product[i].img;
         box.appendChild(image);
         var itemtext = document.createElement('div');
         itemtext.className = 'encyc_itemtext';
         box.appendChild(itemtext);
         var encycBtn = document.createElement('i');
         encycBtn.className = 'icon-right-open';
         box.appendChild(encycBtn);
         var contant_text = document.createElement('p');
         contant_text.innerHTML = product[i].description;
         itemtext.appendChild(contant_text)
         var titles = document.createElement('div');
         titles.className = 'encyc_title';
         titles.innerHTML = product[i].title;
         container.appendChild(titles);
   }